Учебные проекты2/Виртуальные таблицы регистров/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вебсайт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Catalogs/ВидыКонтактнойИнформации/Ext/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт 
	ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес; 
	ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ФактическийАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ТелефонКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = EMailКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
	ПредопределенныйОбъект.Записать();
КонецПроцедуры
